{"inkVersion":21,"root":[["^Egypt, the year XX23, Saqqara Dessert","\n","^CHILD 1: Look, danger! ","#","^speaker:1child ","/#","#","^potrait:scaredChild","/#","\n","^CHILD 2: Don’t hurt us!  ","#","^speaker:2child ","/#","#","^potrait:scaredChild","/#","\n","^NOLWAZI: I'm not here to cause trouble. ","#","^speaker:1Nolwazi ","/#","#","^potrait: sadNolwazi","/#","\n","^CHILD 1: We know who you are don’t take our family away, we have done nothing wrong! ","#","^speaker :2Child ","/#","#","^potrait:scaredChild","/#","\n","^NOLWAZI: I’m not here to take your family away, I just need help finding some information. I promise I mean no harm.","#","^speaker:1Nolwazi ","/#","#","^potrait: sadNolwazi","/#","\n","^Out of fear the children scatter, running towards the village square. Safiya, the current chief, sees the commotion and approaches Nolwazi with caution.","\n","^SAFIYA:What brings you to our village? I want to believe that you do not want any trouble. ","#","^speaker:2Safiya ","/#","#","^potrait:neutralSafiya","/#","\n","^Nolwazi takes a deep breath and reaches into her bag, retrieving the papyrus with the image of Edrice and Ahmed.","\n","^NOLWAZI:I've been sent on a quest by my grandmother to find the Saqqara Tombs. This papyrus is the only clue I have. I wonder if you can help me.","#","^speaker:1Nolwazi ","/#","#","^potrait: neutralNolwazi","/#","\n","^SAFIYA:That papyrus... how on earth did you get it? It’s linked to our family tree. Come with me.","#","^speaker:2Safiya ","/#","#","^potrait:happySafiya","/#","\n","^Safiya leads Nolwazi to an old, weathered house. Inside, they find Edrice, the village elder, surrounded by historical artifacts. Edrice looks up from her work as Safiya and Nolwazi enter.","\n","^SAFIYA: (to Edrice) Mama, this traveller seeks the Saqqara Tombs. She has something that might peak your interest.","#","^speaker:1Safiya ","/#","#","^potrait:happySafiya","/#","\n","^Edrice regards Nolwazi with a knowing look.","\n","^EDRICE: (nodding) Let me see. Oh dear child, I knew your dearest grandmother, she was an amazing woman. However, I cannot help you, I do not have all the pieces to the puzzle you seek to solve.  That necklace you see on the papyrus; it was a gift from my first love Ahmed. You see, it was stolen from me by my snake of a neighbour Femi.","#","^speaker:2Edrice ","/#","#","^potrait:neutralEdrice","/#","\n","^Nolwazi's face falls, but Edrice continues.","\n","^EDRICE: You will need to retrieve it, but be careful and do not trust her. She has been wanting to bargain that necklace off for years but has never done so because she understands the value that necklace holds to her and I. Treat her with respect, when greeting her say السلام عليكم\" (pronounced as \"as-salamu alaykum\"), it means peace be with you. She will be more open to you, when you greet her with respect. .","#","^speaker:2Edrice ","/#","#","^potrait:neutralEdrice","/#","\n","^Nolwazi: Thank you Edrice. I will go to her. ","#","^speaker:1Nolwazi ","/#","#","^potrait:happyNolwazi","/#","\n","^Greet Femi","\n",{"->":"My_Choices"},["done",{"#f":5,"#n":"g-0"}],null],"done",{"My_Choices":[["ev","str","^Respect","/str","/ev",{"*":".^.c-0","flg":4},"ev","str","^General","/str","/ev",{"*":".^.c-1","flg":4},{"c-0":["^ ",{"->":"Respect"},"\n",{"#f":5}],"c-1":["^ ",{"->":"General"},"\n",{"->":"Other_choice"},{"#f":5}]}],{"#f":1}],"Other_choice":[["ev","str","^respect.","/str","/ev",{"*":".^.c-0","flg":4},{"c-0":["^ ",{"->":"respect"},"\n",{"->":"Next_Choice"},{"#f":5}]}],{"#f":1}],"Next_Choice":[["ev","str","^Next","/str","/ev",{"*":".^.c-0","flg":4},{"c-0":[{"->":"Next"},"\n",{"->":"Next_Choice2"},{"#f":5}]}],{"#f":1}],"Next_Choice2":[["ev","str","^next","/str","/ev",{"*":".^.c-0","flg":4},{"c-0":["^ ",{"->":"next"},"\n",{"->":"Bargain_Choice"},{"#f":5}]}],{"#f":1}],"Bargain_Choice":[["ev","str","^Accept Femi's conditions","/str","/ev",{"*":".^.c-0","flg":4},"ev","str","^Reject Femi's conditions","/str","/ev",{"*":".^.c-1","flg":4},{"c-0":[{"->":"Accept"},"\n",{"#f":5}],"c-1":[{"->":"Reject"},"\n",{"->":"Bargain2_Choice"},{"#f":5}]}],{"#f":1}],"Bargain2_Choice":[["ev","str","^Reconsider Femi's conditions","/str","/ev",{"*":".^.c-0","flg":4},{"c-0":[{"->":"Reconsider"},"\n",{"#f":5}]}],{"#f":1}],"Respect":["^Nolwazi: As-salamu alaykum Auntie. I am Nolwazi. I am on a quest and I believe you might have something that will help me Edrice sent me and told me of a necklace in your possession.","#","^speaker:1Nolwazi ","/#","#","^potrait:happyNolwazi","/#","\n","^Femi: Is this another one of Edrice’s tricks to get my necklace? I've had that necklace for years and I plan on selling it young lady. I will not be giving it away for free. What do you have in return? ","#","^speaker:2Femi ","/#","#","^potrait:angryFemi","/#","\n",{"->":"Next_Choice"},"done",{"#f":1}],"Next":["^NOLWAZI: I’m willing to bargain with you, anything you want, just say the word. ","#","^speaker:1Nolwazi ","/#","#","^potrait:neutralNolwazi","/#","\n","^FEMI: Why is this necklace so important to you anyway? It’s a battered old thing of little value. ","#","^speaker:2Femi ","/#","#","^potrait:angryFemi","/#","\n","^NOLWAZI: That can’t be true. Anyway, It is a clue to solving a puzzle left by my grandmother, her name was Nandi you might have known her. ","#","^speaker:1Nolwazi ","/#","#","^potrait:neutralNolwazi","/#","\n","^FEMI:Yes I knew her, she was always kind to me.Mmmmh… Okay girlie, If what you say is true and you really want the necklace, I’ll make you a deal. Go to the local market and trade in your gold bracelet  for 150 gold coin. Then go to Kareem and say aunty Femi sent you and get bay leaves, Saffron, Anise, Sumac and Incense. He should give you 27 gold coins back. Go back to the little children running around and split the coins equally between them and they shall give you a beaded necklace back, bring that beaded necklace to me.","#","^speaker:2Femi ","/#","#","^potrait:angryFemi","/#","\n",{"->":"Bargain_Choice"},{"#f":1}],"Accept":["^Nolwazi: Fine.","#","^speaker:1Nolwazi ","/#","#","^potrait:neutralNolwazi","/#","\n","^Femi: Once I have all those things, only then will I give you the necklace back.","\n",{"->":"Next_Choice2"},"done",{"#f":1}],"Reject":["^Nolwazi: That is too much to ask for a necklace.","#","^speaker:1Nolwazi ","/#","#","^potrait:neutralNolwazi","/#","\n","^Femi: If you do not like it, then you can leave!","\n",{"->":"Bargain2_Choice"},{"#f":1}],"Reconsider":["^Nolwazi: Okay Fine, I will do it.","#","^speaker:1Nolwazi ","/#","#","^potrait:neutralNolwazi","/#","\n","^Femi: Good, once you have all those things, then I will give you the necklace.","\n",{"->":"Next_Choice2"},"done","done",{"#f":1}],"General":["^Nolwazi:Hello, I am Nolwazi.","#","^speaker:1Nolwazi ","/#","#","^potrait:neutralNolwazi","/#","\n","^Femi: I have no interest in whateveryou have to say. Goodbye!.","#","^speaker:2Femi ","/#","#","^potrait:angryFemi","/#","\n",{"->":"Other_choice"},{"#f":1}],"respect":["^Femi: Oh you have learnt some respect now.Is this another one of Edrice’s tricks to get my necklace? I've had that necklace for years and I plan on selling it young lady. I will not be giving it away for free. What do you have in return?.","#","^speaker:2Femi ","/#","#","^potrait:angryFemi","/#","\n",{"->":"Next_Choice"},"done",{"->":"Next_Choice2"},{"#f":1}],"next":["^Nolwazi: Here are all the things you asked for. ","#","^speaker:1Nolwazi ","/#","#","^potrait:neutralNolwazi","/#","\n","^FEMI: (reluctantly) Here, take the darn thing. It's caused enough trouble..","#","^speaker:2Femi ","/#","#","^potrait:angryFemi","/#","\n","^NOLWAZI: Edrice told me the story of this necklace. I know Ahmed broke your heart. ","#","^speaker:1Nolwazi ","/#","#","^potrait:neutralNolwazi","/#","\n","^FEMI: Do not talk about things you do not understand, girl. You have your necklace, now go!.","#","^speaker:2Femi ","/#","#","^potrait:angryFemi","/#","\n","^NOLWAZI: Actually I do understand. I understand what it feels like to live with regrets. And I can tell you now that you are missing out on a valuable friendship,the anger you are holding onto is not worth it Femi, you are only hurting yourself. let it go. ","#","^speaker:1Nolwazi ","/#","#","^potrait:neutralNolwazi","/#","\n","^FEMI: I said get out!.","#","^speaker:2Femi ","/#","#","^potrait:angryFemi","/#","\n","^NOLWAZI: No. I will not leave until you agree to come with me. Edrice needs her friend and so do you.","#","^speaker:1Nolwazi ","/#","#","^potrait:neutralNolwazi","/#","\n","^FEMI: (Considers) Fine. .","#","^speaker:2Femi ","/#","#","^potrait:angryFemi","/#","\n","^At Edrice’s house:","\n","^FEMI: (apologetic) Edrice, I'm sorry. The envy consumed me, what I did was terrible. Forgive me. .","#","^speaker:1Femi ","/#","#","^potrait:angryFemi","/#","\n","^Edrice nods, understanding Femi's emotions.","\n","^EDRICE: (forgiving) Femi, I am not innocent either, I am sorry for my part in this too, I hope you find it in your heart to forgive me. I forgive you, let us put the past behind us.  ","#","^speaker:2Edrice ","/#","#","^potrait:happyEdrice","/#","\n","^FEMI: Of course.","#","^speaker:1Femi ","/#","#","^potrait:happyFemi","/#","\n","^They embrace, and Nolwazi watches as the two women make amends.","\n","^INT. SAQQARA TOMBS - DAY","\n","^Edrice, Femi, and Nolwazi walk together towards the Saqqara Tombs. The ancient structures rise in the distance, a testament to the enduring history of this village. ","#","^speaker:1Edrice ","/#","#","^potrait:happyEdrice","/#","\n","^EDRICE: (smiling) Nolwazi, you've helped mend a long-standing wound in our village. We are in your debt and will gladly show you the Saqqara tombs. ","#","^speaker:1Edrice ","/#","#","^potrait:happyEdrice","/#","\n","^Nolwazi's heart swells with gratitude as she embarks on her quest to explore the hidden wonders of the Saqqara Tombs, with new friends by her side.","\n","^NOLWAZI: Thank you so much! ","#","^speaker:2Nolwazi ","/#","#","^potrait: happyNolwazi","/#","\n","^FEMI: Before you leave Nolwazi, Edrice has something very important to tell you. (nudges Edrice.) ","#","^speaker:1Femi ","/#","#","^potrait: happyFemi","/#","\n","^EDRICE: It is about the reassure you seek. In the days of ancient Egypt, Pharaoh Amon-Ra, ruled as a great and benevolent king. He was known for his wisdom, fairness, and love for the people of Egypt. Under his rule, Egypt prospered, and the nation's cultural and historical treasures thrived. ","#","^speaker:2Edrice ","/#","#","^potrait: happyEdrice","/#","\n","^One of Pharaoh Amon-Ra's most cherished possessions was an exquisite Egyptian mask, a masterpiece of artistry and craftsmanship. It was adorned with intricate hieroglyphics and adorned with precious gemstones. This mask was not just a symbol of his power and authority but also a reflection of his deep appreciation for Egypt's rich heritage.","\n","^The mask had a story of its own, passed down through generations. It was believed to have been created by a legendary artisan who had infused it with the essence of the Nile River itself, giving it a unique and mystical connection to the land. This mask was said to hold the key to a hidden secret, a secret that would ensure the prosperity and well-being of Egypt for generations to come.","\n","^However, as time passed and Pharaoh Amon-Ra's reign came to an end, the mask disappeared from the annals of history. Some believed it was hidden away in the Saqqara Tombs, its secrets safeguarded for future generations. That is not the whole truth, I know where the mask is, your grandmother requested I hide it and give it to you in hope of your visit here. She thought you might want to have a piece of your grandfather with you.","\n","^Your grandfather he was a dear friend of my Ahmed, and the necklace is the key to finding where the mask is hidden.","\n","^NOLWAZI: My grandfather? Who, wait the Pharoah? You knew him? He was a Pharoah? Oh, my goodness, Grandma never told me any of this at all!","#","^speaker:1Nolwazi ","/#","#","^potrait: neutralNolwazi","/#","\n","^FEMI: Their love was a secret affair, perhaps she did not know how, But now you do know. Do well with the knowledge you have received from here today. With Knowledge comes great power and with power comes great responsibility. ","#","^speaker:2Femi ","/#","#","^potrait: happyFemi","/#","\n","done","done",{"#f":1}],"#f":1}],"listDefs":{}}