{"inkVersion":21,"root":[["^EXT. VILLAGE CENTER - MOZIKI LEADER'S SPACE - DAY","\n","^Nolwazi approaches the wall in the middle of the village and hears the words Moziki again. She follows the voices and meets a group of people. A woman stands out to her.","\n","^Pardon me ma'am. Do you by any chance know this Moziki Leader you speak of? ","#","^speaker:1Nolwazi ","/#","#","^portrait:happyNolwazi","/#","\n","^You are in luck. I am the Moziki Leader, my real name of course is Esther. ","#","^speaker:2MozikiLeader ","/#","#","^portrait: happyMozikiLeader","/#","\n","^I have been searching this village for you forever. Nice to meet you. I am Nolwazi. ","#","^speaker:1Nolwazi ","/#","#","^portrait:happyNolwazi","/#","\n","^Is that so? Well I hope I am not in trouble.","#","^speaker:2MozikiLeader ","/#","#","^portrait: happyMozikiLeader","/#","\n","^No not at all. I come in peace. ","#","^speaker:1Nolwazi ","/#","#","^portrait:happyNolwazi","/#","\n","^Good. In that case it is a pleasure to meet you Nolwazi. I have been hard to find because of the busy activities involving today. You see we are preparing for a festival, a solemn one for the passing of the elder's son-in-law.","#","^speaker:2MozikiLeader ","/#","#","^portrait: happyMozikiLeader","/#","\n","^Oh yes I heard of that. I have just returned from the Elder actually. I told him I would be of assistance to you, in exchnage you might be able to give me some answers. ","#","^speaker:1Nolwazi ","/#","#","^portrait:happyNolwazi","/#","\n","^Really? Well then let's get you right to work. I need your help gathering some  essential items.We need Cham-cham, a traditional drink, and decorations to honor his memory.","#","^speaker:2MozikiLeader ","/#","#","^portrait: happyMozikiLeader","/#","\n","^Alright. But may I ask, what significance does the festival hold? ","#","^speaker:1Nolwazi ","/#","#","^portrait:happyNolwazi","/#","\n","^This festival is a tribute to the elder's son-in-law, a way for the community to come together in remembrance.","#","^speaker:2MozikiLeader ","/#","#","^portrait: happyMozikiLeader","/#","\n","^Okay Understood. Is there anything else? ","#","^speaker:1Nolwazi ","/#","#","^portrait:happyNolwazi","/#","\n","^There is one more task. It would be fitting if you could finish the wall for the festival. It symbolizes unity and strength.Oh! I will also need you to convince the widow to join the festival, it wll help her grieve and let go.","#","^speaker:2MozikiLeader ","/#","#","^portrait: happyMozikiLeader","/#","\n","^I was hoping you would say that.","#","^speaker:1Nolwazi ","/#","#","^portrait:happyNolwazi","/#","\n","^You're a hard worker. You will not work alone of course it's a collective effort, a symbol of our unity as Moziki. Each brick represents a member's contribution.","#","^speaker:2MozikiLeader ","/#","#","^portrait: happyMozikiLeader","/#","\n","^What is Moziki exactly? ","#","^speaker:1Nolwazi ","/#","#","^portrait:happyNolwazi","/#","\n","^Moziki is a group of people dedicated to providing for the community. Together, we thrive.","#","^speaker:2MozikiLeader ","/#","#","^portrait: happyMozikiLeader","/#","\n","^Oh that makes a lot of sense. All this while I thought I was looking for one person ","#","^speaker:1Nolwazi ","/#","#","^portrait:happyNolwazi","/#","\n","^Laughs, oh no but we are all truly grateful for your presence here. ","#","^speaker:2MozikiLeader ","/#","#","^portrait: happyMozikiLeader","/#","\n","^Nolwazi nods, feeling a sense of purpose.She sets out on her tasks, determined to contribute to the festival and understand the deeper meaning of Moziki. She returns to the Elder and retrives the cham cham drink from him","\n","end",["done",{"#f":5,"#n":"g-0"}],null],"done",{"#f":1}],"listDefs":{}}