{"inkVersion":21,"root":[["^Nolwazi Lands in Tanzania unsure of if she is in the right place after being captured by the governmnet officials. She sees a single old man sitting beneath a magnificant tree. She spproaches him.","\n","^Excuse me, sir. My name is Nolwazi. I believe I must have lost my way. Can you help me with directions? ","#","^speaker:1Nolwazi ","/#","#","^portrait:neutralNolwazi","/#","\n","^(Gently, with a weathered smile)","\n","^Welcome, Nolwazi. I am Kibwana, a guardian of this village, the keeper of its memories. You have not lost your way; you are here for a reason.(He gestures to the stones on the ground.)","\n","^These stones, they are the key to your quest.","#","^speaker:2Kibwana ","/#","#","^portrait:seriousKibwana","/#","\n","^How did you know about my quest?","#","^speaker:1Nolwazi ","/#","#","^portrait:neutralNolwazi","/#","\n","^I have lived many years; I know the face of a wondering traveler when I see one. Your face is lined with the questions that consume your mind. I tell you the answer is with these stones.","#","^speaker:2Kibwana ","/#","#","^portrait:seriousKibwana","/#","\n","^Stones? What am I to do with them? How can a bunch of stones help me?","#","^speaker:1Nolwazi ","/#","#","^portrait:neutralNolwazi","/#","\n","^You have come to me for help. What can a withered old man do to help you?","#","^speaker:2Kibwana ","/#","#","^portrait:seriousKibwana","/#","\n","^I don’t know. I just trust that you can, I suppose.","#","^speaker:1Nolwazi ","/#","#","^portrait:neutralNolwazi","/#","\n","^And why do you trust me?","#","^speaker:2Kibwana ","/#","#","^portrait:seriousKibwana","/#","\n","^You look trustworthy, I suppose.","#","^speaker:1Nolwazi ","/#","#","^portrait:neutralNolwazi","/#","\n","^I suppose I have that face. Just like me, these stones do not look like much, but they are worth more than all your years. You must trust that they can be of assistance. These stones hold the wisdom of our people, just as the intricate beads of the Maasai necklace do. They are both puzzle and promise. Assemble them, and you will unlock the tales they carry within. But you must be patient, for they have much to tell.","#","^speaker:2Kibwana ","/#","#","^portrait:seriousKibwana","/#","\n","^And what do the Maasai beads signify, Kibwana?","#","^speaker:1Nolwazi ","/#","#","^portrait:neutralNolwazi","/#","\n","^(His voice carries the weight of generations)","\n","^The Maasai beads, they are our heritage, the symbols of unity and strength that once bound our people together. But as time passed, our youth sought the allure of the cities, leaving behind the traditions we cherished. My dearest wife, Zawadi, believed fervently that our customs would never fade. She rests beneath this very tree.","\n","^(His gaze turns to the tree.)","\n","^In her honor, I remain, both guardian and farmer, tending to the land where we grew. This village, our childhood home, became my charge.","#","^speaker:2Kibwana ","/#","#","^portrait:seriousKibwana","/#","\n","^It must have been a great responsibility, Kibwana. So, what is the significance of these stones, and how do they relate to my quest?","#","^speaker:1Nolwazi ","/#","#","^portrait:neutralNolwazi","/#","\n","^Indeed, Nolwazi. These stones, they are linked to the past and the future. To understand our culture and your quest, you must explore this village, find the missing beads, and assemble them to complete the Maasai necklace. Once you have done this, return to this tree, where my Zawadi lies. There, you shall learn the profound symbolism of our Maasai beads and the stories they carry. Your journey is one of connection and preservation, much like the beads themselves, a weaving together of our past and your future.","#","^speaker:2Kibwana ","/#","#","^portrait:seriousKibwana","/#","\n","end",["done",{"#f":5,"#n":"g-0"}],null],"done",{"#f":1}],"listDefs":{}}